imageprocessing/beamer/5/imageprocessing_5.org
 # +LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage{etex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \DeclareMathOperator*{\median}{median}
#+LATEX_HEADER: \usepackage{clrscode}
 # +LATEX_HEADER: \usepackage[usenames]{color}
#+LATEX_HEADER: \usepackage{pstricks}
#+LATEX_HEADER: \usepackage{pgfplots}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[europeanresistors,americaninductors]{circuitikz}
#+LATEX_HEADER: \usepackage{colortbl}
#+LATEX_HEADER: \usepackage{yfonts}
#+LATEX_HEADER: \usetikzlibrary{shapes,arrows}
#+LATEX_HEADER: \usetikzlibrary{positioning}
#+LATEX_HEADER: \usetikzlibrary{arrows,shapes}
#+LATEX_HEADER: \usetikzlibrary{intersections}
#+LATEX_HEADER: \usetikzlibrary{calc,patterns,decorations.pathmorphing,decorations.markings}
#+LATEX_HEADER: \usepackage[BoldFont,SlantFont,CJKchecksingle]{xeCJK}
#+LATEX_HEADER: \setCJKmainfont[BoldFont=Evermore Hei]{Evermore Kai}
#+LATEX_HEADER: \setCJKmonofont{Evermore Kai}
 # +LATEX_HEADER: \xeCJKsetup{CJKglue=\hspace{0pt plus .08 \baselineskip }}
#+LATEX_HEADER: \usepackage{pst-node}
#+LATEX_HEADER: \usepackage{pst-plot}
#+LATEX_HEADER: \psset{unit=5mm}

#+startup: beamer
#+LaTeX_CLASS: beamer
# +LaTeX_CLASS_OPTIONS: [bigger]
#+latex_header: \usepackage{beamerarticle}
# +latex_header: \mode<beamer>{\usetheme{JuanLesPins}}
#+latex_header: \mode<beamer>{\usetheme{Frankfurt}}
#+latex_header: \mode<beamer>{\usecolortheme{dove}}
#+latex_header: \mode<article>{\hypersetup{colorlinks=true,pdfborder={0 0 0}}}

#+TITLE:  图像恢复
#+AUTHOR:    
#+EMAIL:
#+DATE:
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+latex_header: \AtBeginSection[]{\begin{frame}<beamer>\frametitle{Topic}\tableofcontents[currentsection]\end{frame}}

#+latex_header:\setbeamercovered{transparent}
#+BEAMER_FRAME_LEVEL: 2
#+COLUMNS: %40ITEM %10BEAMER_env(Env) %9BEAMER_envargs(Env Args) %4BEAMER_col(Col) %10BEAMER_extra(Extra)










* 概述
** 图像退化与恢复
-  图像退化

    图像在形成、记录、处理和传输过程中，由于成像系统、记录设备、传输介质和处理方法的不完善，会导致图像质量下降。这一过程称为图像的退化。

-  图像恢复
    -  图像的恢复就是要尽可能恢复退化图像的本来面目，它是沿图像退化的逆过程进行。
    -  典型的图像恢复是根据图像退化的先验知识建立一个退化模型，以此模型为基础，采用各种逆退化处理方法进行恢复，使图像质量得到改善。
** 图像退化原因与形式
- 图像退化形式
   - 模糊
   - 失真
   - 噪声
- 图像退化原因
   - 运动、对焦
   - 摄像机标定
   - 成像器件性能

* 图像退化与恢复模型
** 退化与恢复过程

- 退化过程可以被模型化为一个退化函数和一个加性噪声项，处理一幅输入图像 $f(x,y)$ 产生一幅退化图像 $g(x,y)$ 。
- 给定 $g(x,y)$ 和关于退化函数H的一些知识以及外加噪声项 $n(x,y)$ ，图像复原的目的是获得关于原始图像的近似估计 $\hat f(x,y)$ 。


** 退化模型

\[ g(x,y) = H[f(x,y)+n(x,y) \]


** 线性退化模型

如果退化函数 $H$ 是一个线性、平移不变函数，那么在空间域中给出的退化图像可由下式给出：

\begin{align*}
g(x,y) &= h(x,y)\otimes f(x,y)+n(x,y)\\
G(u,v) &= H(u,v)F(u,v)+N(u,v)
\end{align*}

* 噪声模型
** 有噪声情况下的图像恢复
- 必须知道噪声的统计特性以及噪声和图像信号的相关情况，这是非常复杂的。在实际应用中，往往假设噪声是白噪声，即它的频谱密度为常数，且与图像不相关。
- 不同的恢复技术需要不同的有关噪声的先验信息，（例如：维纳滤波器需要知道噪声的谱密度，约束反卷积法需要知道噪声的协方差）。

** 噪声模型
- 数字图像的噪声主要来源于图像的获取和传输过程。图像传输器的工作情况受各种因素的影响，如图像获取中的环境条件和传感器件自身的质量
- 存在的一些重要的噪声类型：高斯噪声、瑞利噪声、伽马噪声、指数分布噪声、均匀分布噪声、脉冲噪声等

** 噪声的空间和频率特性
- 假设噪声独立于空间坐标，并且它与图像本身无关联
- 当噪声的傅里叶谱是常量时，噪声通常称为白噪声

** 高斯噪声(Gaussian noise)
- 概率密度函数（PDF)
\[p(z)=\frac{1}{\sqrt{2\pi}\sigma}e^{-\frac{(z-\mu)^2}{2\sigma^2}}  \]

** 瑞利噪声(Rayleigh noise)
- 概率密度函数（PDF)

\[
p(z)=
\begin{cases}
\frac{2}{b}(z-a)e^{-\frac{(z-a)^2}{b}},\qquad  x\geq a \\
0 ,\qquad x<a
\end{cases}
\]

- 均值与方差
   \begin{align*}
    \bar z &= a+\frac{\sqrt{\pi b}}{2} \\
    \sigma^2 &=  \frac{b(4-\pi)}{4}
   \end{align*}

** 爱尔朗（伽马）噪声(Erlang(Gamma) noise)
- 概率密度函数（PDF)
\[
p(z) = 
\begin{cases}
\frac{a^bz^{b-1}}{(b-1)!}e^{-az}, \qquad  z\geq 0 \\
0 , \qquad z<0
\end{cases}
 \]

- 均值与方差
   \begin{align*}
    \bar z &= \frac{b}{a} \\
    \sigma^2 &=  \frac{b}{a^2}
   \end{align*}

** 指数噪声(Exponential noise)
- 概率密度函数
\[ p(z) = 
\begin{cases}
a e^{-az}, \qquad z\geq 0 \\
0, \qquad z<0
\end{cases}
\]
- 均值与方差
\begin{align*}
    \bar z &= \frac{1}{a} \\
    \sigma^2 &=  \frac{1}{a^2}
\end{align*}

** 均匀噪声(Uniform noise)
- 概率密度函数
\[ p(z) = 
\begin{cases}
\frac{1}{b-a}, \qquad a\leq z \leq b \\
0, \qquad \text{其它}
\end{cases}
\]
- 均值与方差
\begin{align*}
    \bar z &= \frac{a+b}{2} \\
    \sigma^2 &=  \frac{(b-a)^2}{12}
\end{align*}

** 脉冲(椒盐)噪声(Impulse(salt and pepper) noise)
- 概率密度函数
\[ p(z) = 
\begin{cases}
p_a, \qquad z=a \\
p_b, \qquad z=b \\
0, \qquad \text{其它}
\end{cases}
\]

** 周期噪声
- 图像获取过程中的电气、机电干扰
- 可通过频域滤波减轻影响

* 噪声参数估计与滤波
** 周期噪声参数估计
- 通过检测图像的傅里叶谱进行估计。
   - 直接从图像中推断噪声分量的周期性，但这仅仅在非常简单的情况下才是可能的。
   - 周期噪声通常会产生频率尖峰，这些尖峰通过视觉分析经常可以检侧到。
- 当噪声尖峰格外显著或可以使用关于干扰的频率分量一般位置的某些知识时，自动分析是可能的。

** 噪声存在下的唯一空间滤波恢复
\begin{align*}
g(x,y)&=f(x,y)+n(x,y)\\
G(u,v)&=F(u,v)+N(u,v)
\end{align*}

- 当仅有加性噪声存在时，可以选择空间滤波方法。
- 均值滤波器
- 顺序统计滤波器
- 自适应滤波器

* 均值滤波器
** 均值滤波器
- 算术均值滤波器
- 几何均值滤波器
- 谐波均值滤波器
- 逆谐波均值滤波器   
** 算术均值滤波器
- 算术均值滤波器是最简单的均值滤波器。令 $S_{xy}$ 表示中心在 $(x,y)$ 点，尺寸为 $m\times n$ 的矩形子图像窗口的坐标组。
计算由 $S_{xy}$ 定义的区域中被干扰图像 $g(x,y)$ 的平均值。在任意点 $(x,y)$ 处复原图像就是用 $S_{xy}$ 定义区域的像素计算出来的算术均值。即：

\[ \hat f(x,y) = \frac{1}{mn}\sum_{(s,t)\in S_{xy}}g(s,t) \]

** 几何均值滤波器

\[ \hat f(x,y) = \left[\prod_{(s,t)\in S_{xy}}g(s,t)\right]^{\frac{1}{mn}} \]

- 每个被复原像素等于子图像窗口中像素点乘积的 $\frac{1}{mn}$ 次幂。
- 几何均值滤波器所达到的平滑度可以与算术均值滤波器相比，但在滤波过程中会丢失更少的图像细节。

** 谐波均值滤波器
- 使用谐波均值滤波器的操作由如下表达式给出：
   \[ \hat f(x,y) = \frac{mn}{\sum_{(s,t)\in S_{xy}}\frac{1}{g(s,t)}} \]

- 谐波均值滤波器对于“盐” 噪声效果较好，但不适于“胡椒”噪声。它善于处理高斯噪声。

** 逆谐波均值滤波器
- 逆谐波均值滤波操作对一幅图像的复原基于表达式：
     \[ \hat f(x,y) = \frac{\sum_{(s,t)\in S_{xy}}g(s,t)^{Q+1}}{\sum_{(s,t)\in S_{xy}}g(s,t)^Q} \]
- 其中Q称为滤波器的阶数。这种滤波器适合减少或是在实际中消除椒盐噪声的影响。
     - 当 $Q$ 值为正数时，滤波器用于消除“胡椒”噪声;
     - 当 $Q$ 值为负数时，滤波器用于消除“盐”噪声。
     - 当 $Q=0$ 时，逆谐波均值滤波器退变为算术均值滤波器;
     - 当 $Q=-1$ 时，逆谐波均值滤波器退变为谐波均值滤波器。

* 统计排序滤波器
** 统计排序滤波器
统计滤波器是空间域滤波器，它们的响应基于由滤波器包围的图像区域中像素点的排序。滤波器在任何点的响应由排序结果决定。

- 中值滤波器
- 最大值和最小值滤波器
- 中点滤波器
- 修正后的阿尔法均值滤波器

** 中值滤波器
# \DeclareMathOperator*{\median}{median}
\[  \hat f(x,y) = \median_{(s,t)\in S_{xy}} g(s,t) \]
# \[  \hat f(x,y) = median\{g(s,t)\mid(s,t)\in S_{xy} \} \]
- 中值滤波器的应用非常普遍，对于很多种随机噪声，它都有良好的去噪能力，
- 在相同尺寸下比起线性平滑滤波器引起的模糊较少。
- 中值滤波器尤其对单极或双极脉冲噪声非常有效。


** 最大值滤波器
# \[  \hat f(x,y) = \max\{g(s,t)\mid(s,t)\in S_{xy} \} \]
\[  \hat f(x,y) = \max_{(s,t)\in S_{xy}}g(s,t) \]
- 最大值滤波器在发现图像中的最亮点时非常有用。
- 同样，因为“胡椒”噪声是非常低的值，作为子图像区域Sxy的最大值选择结果，它可以通过这种滤波器消除。

** 最小值滤波器
\[  \hat f(x,y) = \min_{(s,t)\in S_{xy}}g(s,t) \]
- 对发现图像中的最暗点非常有用。
- 作为最小值操作的结果，它可以用来消除“盐”噪声。

** 中点滤波器
\[  \hat f(x,y) = \frac{1}{2}\left[\max_{(s,t)\in S_{xy}}g(s,t)+\frac{1}{2}\min_{(s,t)\in S_{xy}}g(s,t)\right] \]
- 结合了顺序统计和求平均，对于高斯和均匀随机分布这类噪声有最好的效果。

** 修正后的阿尔法均值滤波器
在 $S_{xy}$ 邻域内去掉 $g(s,t)$ 最高灰度值的 $\frac{d}{2}$ 和最低灰度值的 $\frac{d}{2}$ 。用 $g_r(s,t)$ 来代表剩余的 $mn-d$ 个像素。
由这些剩余像素点的平均值形成的滤波器称为修正后的阿尔法均值滤波器。
\[ \hat f(x,y) = \frac{1}{mn-d}\sum_{(s,t)\in S_{xy}}g_r(s,t) \]
- 其中，$d$ 值可以取 $0$ 到 $mn-1$ 之间的任意数。
- 修正后的阿尔法均值滤波器在包括多种噪声的情况下非常适用，例如高斯噪声和椒盐噪声混合的情况下。

* 自适应滤波器
