imageprocessing/beamer/5/imageprocessing_5.tex

\section{自适应滤波器}
\label{sec:orgeaa3050}
\begin{frame}[label={sec:orgc6dc8cc}]{自适应、局部噪声消除滤波器}
\begin{itemize}
\item 随机变量最简单的统计度量是均值和方差。这些适当的参数是自适应滤波器的基础，因为它们是与图像状态紧密相关的数据。
\item 均值给出了计算均值的区域中灰度平均值的度量，
\item 方差给出了这个区域的平均对比度的度量。
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgc8912b3}]{自适应、局部噪声消除滤波器}
\[ \hat f(x,y)=g(x,y)-\frac{\sigma_n^2}{\sigma_L^2}(g(x,y)-m_L) \]

\begin{itemize}
\item \(g(x,y)\) 表示图像在点 \((x,y)\) 上的值
\item \(\sigma^2_n\) 表示干扰的方差
\item \(m_L\) 表示 \(S_{xy}\) 上像素点的局部均值
\item \(\sigma_L^2\) 表示 \(S_{xy}\) 上像素点的局部方差
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org297659e}]{自适应中值滤波器}
\begin{itemize}
\item 自适应中值滤波器可以处理具有更大概率的冲激噪声。
\item 平滑非冲激噪声时可以更好地保存细节。
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org8d389e0}]{自适应中值滤波器}
如下标记符号：
\begin{itemize}
\item \(z_{min}\) 表示 \(S_{xy}\) 中灰度级的最小值
\item \(z_{max}\) 表示 \(S_{xy}\) 中灰度级的最大值
\item \(z_{med}\) 表示 \(S_{xy}\) 中灰度级的中值
\item \(z_{xy}\) 表示坐标 \((x,y)\) 上的灰度级
\item \(S_{max}\) 表示 \(S_{xy}\) 允许的最大尺寸
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org7e6e702}]{自适应中值滤波器}
 \begin{codebox}
\Procname{自适应中值滤波器}
 \zi      \Repeat
 \zi    $ A_1 \gets z_{med}-z_{min}$ 
 \zi    $ A_2 \gets z_{med}-z_{max}$ 
 \zi    \If  $A_1>0$ and  $A_2<0$ 
 \zi        \Then 
 \zi             $ B_1 \gets z_{xy}-z_{min}$ 
 \zi             $ B_2 \gets z_{xy}-z_{max}$ 
 \zi             \If  $B_1>0$ and  $ B_2<0$ 
 \zi               \Then \Return $z_{xy}$
 \zi               \Else \Return $z_{med}$
                 \End
 \zi        \Else increase the window-size
        \End  
 \zi \Until $window-size > S_{max}$ 
 \zi \Return $z_{med}$
 \end{codebox}
\end{frame}

\section{周期噪声滤波}
\label{sec:org8286c41}
\begin{frame}[label={sec:org4802d73}]{周期噪声滤波}
\begin{itemize}
\item 带阻滤波器
\item 带通滤波器
\item 陷波滤波器
\item 最佳陷波滤波器
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4cb8198}]{带阻滤波器}
\begin{itemize}
\item 带阻滤波器消除或衰减了傅里叶变换原点处的频段。
\item 带阻滤波器的主要应用之一是在频域噪声分量位置近似已知的应用中消除噪声。
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org7ec4eb3}]{理想带阻滤波器}
\[ H(u,v)=
\begin{cases}
1, \qquad D(u,v)<D_0-\frac{W}{2} \\
0, \qquad D_0-\frac{W}{2} \leq D(u,v) \leq D_0+\frac{W}{2}\\
1, \qquad D(u,v)>D_0+\frac{W}{2}
\end{cases} \]

其中， \(D(u,v)\) 是到中心化频率矩形原点的距离，\(W\) 是频带的宽度， \(D_0\) 是频带的中心半径。
\end{frame}

\begin{frame}[label={sec:org90a9a7f}]{n阶巴特沃思(Butterworth)带阻滤波器}
\[ H(u,v) = \frac{1}{1+\left(\frac{D(u,v)W}{D^2(u,v)-D_0^2}\right)^{2n}} \]
\end{frame}

\begin{frame}[label={sec:orgedf1c30}]{高斯带阻滤波器}
\[ H(u,v)=1-e^{-\frac{1}{2}\left(\frac{D^2(u,v)-D_0^2}{D(u,v)W}\right)^{2n}} \]
\end{frame}

\begin{frame}[label={sec:org3b7aad5}]{带通滤波器}
带通滤波器执行与带阻滤波器相反的操作。
带通滤波器的传递函数 \(H_{bp}(u,v)\) 可由相应的带阻滤波器的传递函数 \(H_{br}(u,v)\) 得到：
\[ H_{bp}(u,v)=1-H_{br}(u,v) \]
\end{frame}

\begin{frame}[label={sec:org604fcd4}]{理想带通滤波器}
\[ H(u,v)=
\begin{cases}
0, \qquad D(u,v)<D_0-\frac{W}{2} \\
1, \qquad D_0-\frac{W}{2} \leq D(u,v) \leq D_0+\frac{W}{2}\\
0, \qquad D(u,v)>D_0+\frac{W}{2}
\end{cases} \]
\end{frame}

\begin{frame}[label={sec:org8490ae4}]{理想Butterworth带通滤波器}
\begin{align*}
H_{Bbp}(u,v) &=1- \frac{1}{1+\left(\frac{D(u,v)W}{D^2(u,v)-D_0^2}\right)^{2n}}\\
&= \frac{\left(\frac{D(u,v)W}{D^2(u,v)-D_0^2}\right)^{2n}}{1+\left(\frac{D(u,v)W}{D^2(u,v)-D_0^2}\right)^{2n}}
\end{align*}
\end{frame}

\begin{frame}[label={sec:orgc352d27}]{理想Gaussian带通滤波器}
\begin{align*}
H(u,v)&=1-\left(1-e^{-\frac{1}{2}\left(\frac{D^2(u,v)-D_0^2}{D(u,v)W}\right)^{2n}}\right)\\
&=e^{-\frac{1}{2}\left(\frac{D^2(u,v)-D_0^2}{D(u,v)W}\right)^{2n}}
\end{align*}
\end{frame}

\begin{frame}[label={sec:orgdc38ea0}]{陷波滤波器}
\begin{itemize}
\item 陷波滤波器阻止(或通过)事先定义的中心频率邻域内的频率。
\item 由于傅里叶变换是对称的，要获得有效结果，陷波滤波器必须以关于原点对称的形式出现。
\item 可实现的陷波滤波器的对数是任意的。陷波区域的形状也是任意的(例如，矩形)。
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org9a41238}]{理想陷波滤波器}
\begin{align*}
H(u,v) &= \begin{cases}
0,\qquad D_1(u,v)\leq D_0  \\
0, \qquad D_2(u,v)\leq D_0 \\
1, \qquad \text{其它}
\end{cases}\\
D_1(u,v) &=\left((u-u_0)^2+(v-v_0)^2\right)^{\frac{1}{2}}\\
D_2(u,v) &=\left((u+u_0)^2+(v+v_0)^2\right)^{\frac{1}{2}}
\end{align*}

半径为 \(D_0\) ，中心在 \((u_0,v_0)\) 且在 \((-u_0,-v_0)\) 对称
\end{frame}

\begin{frame}[label={sec:orgfc7fb33}]{阶数为n的巴特沃思陷波带阻滤波器}
\[ H(u,v)=\frac{1}{1+\left(\frac{D_0^2}{D_1(u,v)D_2(u,v)}\right)^n} \]
\end{frame}

\begin{frame}[label={sec:orgc35f731}]{高斯陷波带阻滤波器}
\[ H(u,v)=1-e^{-\frac{1}{2}\frac{D_1(u,v)D_2(u,v)}{D_0^2}} \]
\end{frame}

\begin{frame}[label={sec:orge88af29}]{陷波带通滤波器的传递函数：}
\[  H_{np}(u,v)=1-H_{nr}(u,v) \]


当 \(u_0=v_0\) 时， 陷波带通滤波器变为低通滤波器。
\end{frame}

\section{线性位置不变退化}
\label{sec:org2271933}
\begin{frame}[label={sec:orgb8091e0}]{线性位置不变退化模型}
\begin{align*}
 H[af_1(x,y)+bf_2(x,y)] &= aH[f_1(x,y)]+bH[f_2(x,y)] \\
  H[f(x,y)] &= g(x,y) \\
 H[f(x-\alpha,y-\beta)] &= g(x-\alpha,y-\beta)
\end{align*}
\end{frame}

\begin{frame}[label={sec:org6517c26}]{脉冲响应}
\begin{align*}
H[\delta(x,y)] &= h(x,y) \\
H[\delta(x-\alpha,y-\beta)] &= h(x-\alpha,y-\beta) \\
H[f(\alpha,\beta)\delta(x-\alpha,y-\beta)] &=f(\alpha,\beta)h(x-\alpha,y-\beta) \\
\end{align*}
\end{frame}

\begin{frame}[label={sec:orgd3b21ba}]{卷积}
\begin{align*}
g(x,y) &=H[f(x,y)] \\
&= H[f(x,y)*\delta(x,y)] \\
&= H\left[\int_{-\infty}^{\infty}\int_{-\infty}^{\infty} f(\alpha,\beta)\delta(x-\alpha,y-\beta) d\alpha d\beta\right] \\
&= \int_{-\infty}^{\infty}\int_{-\infty}^{\infty} H[f(\alpha,\beta)\delta(x-\alpha,y-\beta)] d\alpha d\beta \\
&= \int_{-\infty}^{\infty}\int_{-\infty}^{\infty} f(\alpha,\beta)H[\delta(x-\alpha,y-\beta)] d\alpha d\beta \\
&= \int_{-\infty}^{\infty}\int_{-\infty}^{\infty} f(\alpha,\beta)h(x-\alpha,y-\beta)d\alpha d\beta \\
&= f(x,y)*h(x,y)
\end{align*}
\end{frame}

\begin{frame}[label={sec:org4c3a71f}]{有噪声退化模型}
\begin{align*}
g(x,y) &=\int_{-\infty}^{\infty}\int_{-\infty}^{\infty} f(\alpha,\beta)h(x-\alpha,y-\beta) d\alpha d\beta +n(x,y)\\
G(u,v) &= H(u,v)F(u,v)+N(u,v)
\end{align*}
\end{frame}

\begin{frame}[label={sec:org7352e74}]{估计退化函数}
\begin{itemize}
\item 图像观察估计法
\item 试验估计法
\item 模型估计法
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org86cce5a}]{图像观测估计法}
\[ H_s(u,v) = \frac{G_s(u,v)}{\hat F_s(u,v)} \]

其中：
\begin{itemize}
\item \(G_s(u,v)\) 为特征明显的部分图像
\item \(\hat F_s(u,v)\) 是对原始图像的估计
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgdd5312b}]{试验估计法}
\[ H(u,v)=\frac{G(u,v)}{A} \]

\begin{itemize}
\item 如果使用与获取退化图像的设备相似的装置，理论上可以得到准确的退化估计。
\item 利用相同的系统设置， 通过对一个脉冲(小亮点)成像可得到退化的脉冲响应。
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org3b6acc9}]{模型估计法}
\begin{itemize}
\item 根据导致模糊的物理过程（先验知识）来确定 \(h(x,y)\) 或 \(H(u,v)\) 。
\item 长时间曝光下大气湍流造成的转移函数
\[ H(u,v) = e^{-k(u^2+v^2)^{\frac{5}{6}}} \]
\item \(k\) 是常数，它与湍流的性质有关。
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org66e3d7f}]{运动模糊}
\begin{itemize}
\item 假设 \(T\) 为曝光时间（快门时间）， \(x_0(t),y_0(t)\) 是位移的 \(x\) 分量和 \(y\) 分量。
\end{itemize}
\begin{align*}
g(x,y) &= \int_0^T f(x-x_0(t),y-y_0(t)) dt \\
g(x,y) &= \int_0^T f(x,y)*\delta(x-x_0(t),y-y_0(t)) dt \\
g(x,y) &= f(x,y)* \int_0^T \delta(x-x_0(t),y-y_0(t)) dt \\
G(u,v) &= F(u,v) \int_0^T \mathcal{F}[\delta(x-x_0(t),y-y_0(t))] dt \\
G(u,v) &= F(u,v) \int_0^T e^{-j2\pi(ux_0(t)+vy_0(t))} dt 
\end{align*}
\end{frame}

\begin{frame}[label={sec:orgfb662c2}]{直线运动模糊}
当
\begin{align*}
x_0(t) &=\frac{at}{T} \\
y_0(t) &=0
\end{align*}
时
\begin{align*}
H(u,v) &=\int_0^T e^{-j2\pi u \frac{at}{T}} dt \\
&=\frac{T}{\pi u a} \sin(\pi u a) e^{-j\pi u a}
\end{align*}
\end{frame}

\begin{frame}[label={sec:orgca07e4d}]{逆滤波}
\begin{align*}
 \hat F(u,v) &= \frac{G(u,v)}{H(u,v)} \\
 \hat F(u,v) &= F(u,v)+\frac{N(u,v)}{H(u,v)} \\
\end{align*}

\begin{itemize}
\item 即使知道退化函数，也不能准确地复原未退化的图像。因为噪声是一个随机函数，其傅氏变换未知。
\item 实际应用逆滤波复原方法时存在病态的问题，即如果退化为零或非常小的值，则 \(\frac{N(u,v)}{H(u,v)}\) 很容易决定复原函数的值。
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org4e0382c}]{最小均方误差滤波(维纳滤波)}
\begin{itemize}
\item 最小均方误差滤波是综合退化函数和噪声统计特征两方面进行复原处理的方法。
\item 目标是找一个未污染图像f的估计值，使它们之间的均方误差最小。误差度量由下式给出：
\[ e^2 = E((f-\hat f)^2) \]
\item 假定：噪声和图像不相关；其中一个有零均值；估计的灰度级是退化图像灰度级的线性函数。
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgc9eef20}]{最小均方误差滤波(维纳滤波)}
\begin{align*}
\hat F(u,v) &= \frac{H^{* } S_f(u,v)}{S_f(u,v)|H(u,v)|^2+S_n(u,v)}G(u,v) \\
&= \frac{H^{* } }{|H(u,v)|^2+\frac{S_n(u,v)}{S_f(u,v)}}G(u,v) \\
&= \frac{1}{H(u,v)}\frac{|H(u,v)|^2 }{|H(u,v)|^2+\frac{S_n(u,v)}{S_f(u,v)}}G(u,v)
\end{align*}

其中：
\begin{itemize}
\item \(H(u,v),H^{*}(u,v)\) 退化函数及其共轭复数
\item \(S_n(u,v)=|N(u,v)|^2\) 噪声功率谱
\item \(S_f(u,v)=|F(u,v)|^2\) 未退化图像的功率谱
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org6b0bf9c}]{最小均方误差滤波(维纳滤波)}
\begin{itemize}
\item 当处理白噪声时，谱 \(|N(u,v)|^2\) 是一个常数，大大简化了处理过程。
\item 未退化图像的功率谱很少是已知。当这些值未知或不能估计时，经常使用的方法是用下面的表达式近似：
\[ \hat F(u,v) = \frac{1}{H(u,v)}\frac{|H(u,v)|^2 }{|H(u,v)|^2+K}G(u,v) \]
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org5670fcd}]{约束最小二乘方滤波器}
\begin{align*}
\hat F(u,v) &= \frac{H^{* }(u,v) }{|H(u,v)|^2+\gamma|P(u,v)|^2}G(u,v)\\
P(u,v)&=\mathcal{F}[p(x,y)]\\
p(x,y)&=
\begin{bmatrix}
0 & -1 & 0 \\
-1 & 4 & -1 \\
0 & -1 & 0 
\end{bmatrix}
\end{align*}
\begin{itemize}
\item 噪声方差和均值经常能从一个给定的退化图像计算出来，这是一个很重要的优点。
\item 维纳滤波建立在最小化统计准则的基础上，在平均意义上它是最优的。
\item 约束最小二乘方滤波器对于处理的每一幅图像它都能产生最优结果。因此，算法的选择往往由结果图像的感知视觉质量决定(至少部分是这样)。
\end{itemize}
\end{frame}
