imageprocessing/beamer/5/imageprocessing_5.org
** 几何均值滤波
\[ \hat F(u,v) =\left(\frac{H^{*}(u,v)}{|H(u,v)|^2}\right)^{\alpha}\left(\frac{H^{ *}(u,v)}{|H(u,v)|^2+\beta \frac{S_n(u,v)}{S_f(u,v)}}\right)^{1-\alpha}G(u,v) \]

* 几何变换
** 几何变换
- 几何变换可在一幅图像中的像素间修改空间关系。
- 几何变换通常又叫做橡皮片变换，因为它们可以被看做在一片橡皮片上打印图像，然后根据预先确定的规则拉伸这个橡皮片的过程。
- 在数字图像处理中，几何变换由两个基本操作组成：
     -  空间变换，它定义了图像平面上像素的重新安排；
     -  灰度级插补，处理空间变换后图像中像素灰度级的赋值。

** 空间变换
- 空间变换中对应的连接点可用多种不同技术建立。例如，一些图像生成系统有物理的人为缺陷(如金属点)，镶嵌在图像传感器上。这产生了一个已知点集(叫做网状标记)，在图像被获取时直接镶在图像上。
- 如果图像由于一些其它处理(如图像显示或图像重建处理)失真了，图像可以用这项技术校正。

** 灰度级插补
- 空间变换方法遍历坐标 $(x,y)$ 的整数值得到复原图像 。然而，根据系数 $c_i$ 的值，根据前边两个式子能产生非整数的 $x',y'$ 。
- 因为失真图像 $g(x,y)$ 是数字的，它的像素值只定义在整数坐标。因此，对 $x',y'$ 用非整数值会导致一个到 $g$ 位置的映射，在这些位置没有灰度定义，所以有必要基于整数坐标的灰度值去推断那些位置的灰度值。

** 双线性插补
- 定义在坐标上 $(x',y')$ 的灰度级 $v(x',y')$ 用下面的关系从它的邻点值被插补。

\[ v(x',y')=a x'+by'+cx'y'+d \]
